In [1]:
import numpy as np
import pandas as pd
import os
import sys

### Đọc dữ liệu

In [19]:
df = pd.read_csv("../data/onlret_transaction.csv", dtype={"CustomerID": str})

In [20]:
df.head(2)

,InvoiceNo,StockCode,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice,Status,CustomerType
0,536365,85123A,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30,1,1
1,536365,71053,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,1,1

In [21]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Quantity', 'InvoiceDate', 'UnitPrice',
       'CustomerID', 'Country', 'TotalPrice', 'Status', 'CustomerType'],
      dtype='object')

In [22]:
df[df.InvoiceNo == "573585"].head(5)

,InvoiceNo,StockCode,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice,Status,CustomerType
430237,573585,11001,2,2011-10-31 14:41:00,3.29,NaN,United Kingdom,6.58,1,0
430238,573585,15036,15,2011-10-31 14:41:00,1.63,NaN,United Kingdom,24.45,1,0
430239,573585,15039,15,2011-10-31 14:41:00,1.63,NaN,United Kingdom,24.45,1,0
430240,573585,15056BL,1,2011-10-31 14:41:00,12.46,NaN,United Kingdom,12.46,1,0
430241,573585,15056N,1,2011-10-31 14:41:00,12.46,NaN,United Kingdom,12.46,1,0

### Chứng minh nhận định

NỘI DUNG NHẬN ĐỊNH:

- Dữ liệu ban đầu **không là dạng chuỗi thời gian**, chỉ ở dạng transaction (giao dịch) thông thường.
- Khả năng chuyển đổi thành time-series: **Có**. Nếu xác định rõ đối tượng cần nghiên cứu (đối tượng phải tồn tại trong dữ liệu) thì sẽ biến đổi được về dạng time-series.

In [24]:
df.CustomerID.value_counts().head(7)

CustomerID
17841    7983
14911    5903
14096    5128
12748    4642
14606    2782
15311    2491
14646    2085
Name: count, dtype: int64

In [25]:
df[df.CustomerID == "14096"]

,InvoiceNo,StockCode,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice,Status,CustomerType
317502,564764,16207B,1,2011-08-30 10:49:00,2.46,14096,United Kingdom,2.46,1,1
317503,564764,16225,1,2011-08-30 10:49:00,3.29,14096,United Kingdom,3.29,1,1
317504,564764,16254,1,2011-08-30 10:49:00,1.63,14096,United Kingdom,1.63,1,1
317505,564764,84249A,1,2011-08-30 10:49:00,0.83,14096,United Kingdom,0.83,1,1
317506,564764,84659A,2,2011-08-30 10:49:00,1.23,14096,United Kingdom,2.46,1,1
...,...,...,...,...,...,...,...,...,...,...
528083,580727,10135,8,2011-12-05 17:17:00,2.46,14096,United Kingdom,19.68,1,1
528084,580727,11001,3,2011-12-05 17:17:00,3.29,14096,United Kingdom,9.87,1,1
528085,580727,15044A,1,2011-12-05 17:17:00,5.79,14096,United Kingdom,5.79,1,1
528086,580727,15056BL,1,2011-12-05 17:17:00,12.46,14096,United Kingdom,12.46,1,1
528087,C580726,CRUK,-1,2011-12-05 17:17:00,1100.44,14096,United Kingdom,-1100.44,0,1

### Chiến lược biến đổi thành data time-series

#### Chiến lược 1: Time-series ở mức hệ thống (System-level time series)

#### Chiến lược 2: Time-series theo sản phẩm (Product-level time series)

#### Chiến lược 3: Time-series theo khách hàng (Customer-level time series)

#### Chiến lược 4: Time-series đa biến (Multivariate time series)